lkolbly/cmsis-svd/data/TexasInstruments/LM4F132C4QC.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C4</name>
      <prependToName>I2C4</prependToName>
      <baseAddress>0x400C0000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C5</name>
      <prependToName>I2C5</prependToName>
      <baseAddress>0x400C1000</baseAddress>
    </peripheral>
    <peripheral>
      <name>SYSEXC</name>
      <description>Register map for SYSEXC peripheral</description>
      <groupName>SYSEXC</groupName>
      <prependToName>SYSEXC</prependToName>
      <baseAddress>0x400F9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RIS</name>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_RIS_IDCRIS</name>
              <description>Input Denormal Exception Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_DZCRIS</name>
              <description>Divide By 0 Exception Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_IOCRIS</name>
              <description>Invalid Operation Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_UFCRIS</name>
              <description>Underflow Exception Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_OFCRIS</name>
              <description>Overflow Exception Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_IXCRIS</name>
              <description>Inexact Exception Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>System Exception Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_IM_IDCIM</name>
              <description>Input Denormal Exception Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_DZCIM</name>
              <description>Divide By 0 Exception Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_IOCIM</name>
              <description>Invalid Operation Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_UFCIM</name>
              <description>Underflow Exception Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_OFCIM</name>
              <description>Overflow Exception Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_IXCIM</name>
              <description>Inexact Exception Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_MIS_IDCMIS</name>
              <description>Input Denormal Exception Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_DZCMIS</name>
              <description>Divide By 0 Exception Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_IOCMIS</name>
              <description>Invalid Operation Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_UFCMIS</name>
              <description>Underflow Exception Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_OFCMIS</name>
              <description>Overflow Exception Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_IXCMIS</name>
              <description>Inexact Exception Flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>System Exception Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSEXC_IC_IDCIC</name>
              <description>Input Denormal Exception Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_DZCIC</name>
              <description>Divide By 0 Exception Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_IOCIC</name>
              <description>Invalid Operation Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_UFCIC</name>
              <description>Underflow Exception Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_OFCIC</name>
              <description>Overflow Exception Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_IXCIC</name>
              <description>Inexact Exception Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
